In [1]:
import pandas as pd

In [25]:
data = {
    "date": ["2020-01-01", "2021-02-15", "22-01-2023", "2021/03/10", "20th April 2021"],
    "country": ["USA", "U.S.A", "United States of America", "United States", "U-S-A"],
    "name": ["Abdus", "Hasn", "Hasn", "Udmaan", "Aiehsya"],
    "sales_2020": [250, 300, None, 400, 150],
    "sales_2021": [None, 310, 260, None, 900]
}

df = pd.DataFrame(data)
df.head()

              date                   country     name  sales_2020  sales_2021
0       2020-01-01                       USA    Abdus       250.0         NaN
1       2021-02-15                     U.S.A     Hasn       300.0       310.0
2       22-01-2023  United States of America     Hasn         NaN       260.0
3       2021/03/10             United States   Udmaan       400.0         NaN
4  20th April 2021                     U-S-A  Aiehsya       150.0       900.0

# MAKE DATE IN SINGLE FORMAT

In [26]:
# Store original 'date' column for reference
original_dates = df['date'].copy()

# Attempt to parse dates, setting unparseable entries to NaT
df['date'] = pd.to_datetime(df['date'], errors='coerce')

# Replace NaT values with the original strings
df['date'] = df['date'].where(df['date'].notna(), original_dates)

#Format dates that were successfully parsed

df['date'] = df['date'].apply(
    lambda x: x.strftime('%y-%m-%d') if pd.notnull(x) and isinstance(x, pd.Timestamp) else x
)

print(df)

       date                   country     name  sales_2020  sales_2021
0  20-01-01                       USA    Abdus       250.0         NaN
1  21-02-15                     U.S.A     Hasn       300.0       310.0
2  23-01-22  United States of America     Hasn         NaN       260.0
3  21-03-10             United States   Udmaan       400.0         NaN
4  21-04-20                     U-S-A  Aiehsya       150.0       900.0

# MAKE COUNTRY IN A ONE SAME FORMAT/SEQUENCE.

In [27]:
# Make Country name on a Single Page

country_mapping = {'USA':'America','United States of America':'America',
                   'U.S.A':'America','United States':'America','U-S-A':'America'}

df['country'] = df['country'].replace(country_mapping)
df

       date  country     name  sales_2020  sales_2021
0  20-01-01  America    Abdus       250.0         NaN
1  21-02-15  America     Hasn       300.0       310.0
2  23-01-22  America     Hasn         NaN       260.0
3  21-03-10  America   Udmaan       400.0         NaN
4  21-04-20  America  Aiehsya       150.0       900.0

# CHECK & DROP DUPLICATES IN DATASET

In [28]:
# To check the presence of Duplication in T/F:
df.duplicated(subset="name")

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [29]:
# Drop the Duplicates in the dataset:
df = df.drop_duplicates(subset = "name")
df

       date  country     name  sales_2020  sales_2021
0  20-01-01  America    Abdus       250.0         NaN
1  21-02-15  America     Hasn       300.0       310.0
3  21-03-10  America   Udmaan       400.0         NaN
4  21-04-20  America  Aiehsya       150.0       900.0

# CORRECT THE SPELLING MISTAKES

In [31]:
# Correct the Typographical Mistakes in Name:

df['name'] = df['name'].replace({'Abdus':'Abdur','Hasn':'Hassan',
                                 'Chanlie':'Charlie','Udmaan':'Usman',
                                 'Aiehsya':'Ayesha'})
df

C:\Users\Abdur Raffay Khan\AppData\Local\Temp\ipykernel_10952\1733478383.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['name'] = df['name'].replace({'Abdus':'Abdur','Hasn':'Hassan',

       date  country    name  sales_2020  sales_2021
0  20-01-01  America   Abdur       250.0         NaN
1  21-02-15  America  Hassan       300.0       310.0
3  21-03-10  America   Usman       400.0         NaN
4  21-04-20  America  Ayesha       150.0       900.0